InformationRegisters/Clouddep_НастройкиАвтозаполненияСоставаГруппыПочтовойРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>Clouddep_НастройкиАвтозаполненияСоставаГруппыПочтовойРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПочтовойРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clouddep_ГруппыПочтовойРассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Clouddep_НастройкиАвтозаполненияСоставаГруппыПочтовойРассылки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаПодбораКонтрагентов = РегистрыСведений.Clouddep_НастройкиАвтозаполненияСоставаГруппыПочтовойРассылки.ПолучитьМакет("СхемаПодбораКонтрагентов");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаПодбораКонтрагентов, ЭтаФорма.УникальныйИдентификатор);
	
	Настройка = СхемаПодбораКонтрагентов.НастройкиПоУмолчанию;
	
	ИДН = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек.Инициализировать(ИДН);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройка);
	
	ОбъектФормы = РеквизитФормыВЗначение("Запись");
	СохраненныеНастройки = ОбъектФормы.Настройка.Получить();
	Если СохраненныеНастройки<>Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(СохраненныеНастройки);
	ИначеЕсли Не ПустаяСтрока(Параметры.АдресНастроекДляНовойЗаписи) Тогда 
		СохраненныеНастройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекДляНовойЗаписи);
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(СохраненныеНастройки.Получить());
	КонецЕсли;
	
	Если ПустаяСтрока(Запись.ИдентификаторНастройки) Тогда
		Запись.ИдентификаторНастройки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Настройка = Новый ХранилищеЗначения(КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
